import subprocess
from input_handler import InteractiveMenu  # Необходимые классы
from menu_actions import connect_to_host, load_hosts, path_to_rac  # Необходимые функции и переменные для работы с меню
import sys

hello_print = r'''
       __________________________________________________________________
  ____L\                         Добро пожаловать!                       \______
 /\       ______   __  __   ______  _____              ____     ______   ____   \
 \ \     /\  _  \ /\ \/\ \ /\__  _\/\  __`\           /\  _`\  /\  _  \ /\  _`\  \
  \ \    \ \ \L\ \\ \ \ \ \\/_/\ \/\ \ \/\ \          \ \ \L\ \\ \ \L\ \\ \ \/\_\ \
   \ \    \ \  __ \\ \ \ \ \  \ \ \ \ \ \ \ \   _______\ \ ,  / \ \  __ \\ \ \/_/_ \
    \ \    \ \ \/\ \\ \ \_\ \  \ \ \ \ \ \_\ \ /\______\\ \ \\ \ \ \ \/\ \\ \ \L\ \ \
     \ \    \ \_\ \_\\ \_____\  \ \_\ \ \_____\\/______/ \ \_\ \_\\ \_\ \_\\ \____/  \
      \ \    \/_/\/_/ \/_____/   \/_/  \/_____/           \/_/\/ / \/_/\/_/ \/___/    \
       \ \______                                                                  _____\
        \______/\_______Автоматическая_консоль_удаленного_администрирования_______\____/
               \/_________________________________________________________________/
'''
def exit_program():
    print("Выход из программы")
    sys.exit(0)

def main():
    print(hello_print)

    while True:  # Бесконечный цикл
        options = ['Подключиться', 'Настройки', 'Выход']
        menu = InteractiveMenu(options, 'Выберите действие:')
        selected_option_index = menu.display_menu()

        actions = {
            0: lambda: connect_to_host(load_hosts, path_to_rac),  # Передайте необходимые аргументы
            1: lambda: print("Настройки еще не реализованы.\n"),
            2: exit_program,
        }

        # Вызываем соответствующую функцию по индексу
        if selected_option_index in actions:
            actions[selected_option_index]()
        else:
            print("Некорректный выбор. Пожалуйста, попробуйте снова.")

if __name__ == "__main__":
    main()